In [1]:
import pandas as pd

In [2]:
dict1 = {
    'Name': ["Priyaj","Aadhya","Krishna","Vedant","Parshv","Mittal","Archana"],
    'Marks': [98,89,99,87,90,83,99],
    'Gender': ["Male",'Female','Female','Male','Male','Female','Female']
}
df = pd.DataFrame(dict1)
df

      Name  Marks  Gender
0   Priyaj     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Diaplay Top 3 Rows of the Dataset

In [3]:
df.head(3)

      Name  Marks  Gender
0   Priyaj     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female

# check last 3 rows of the dataset

In [4]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Find no.of rows & no.of columns

In [5]:
df.shape #shape is not function it's a attribute return type is tuple

(7, 3)

In [6]:
print('Number of rows', df.shape[0])
print('Number od colums',df.shape[1])

Number of rows 7
Number od colums 3

# get information about our dataset

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# check null values in the dataset

In [8]:
df.isnull() #false means no null values

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [9]:
df.isnull().sum() # by deafult it shows column wise null values

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df.isnull().sum(axis=1) # now it showing row wise null value count

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# Get overall statistics About the dataframe

In [11]:
df.describe() # ti only consider numerical values

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [12]:
df.describe(include='all') # this will show all the dataset statistics info

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Priyaj        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

# find unique values from the gender column

In [13]:
df["Gender"]

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [14]:
df["Gender"].unique()

array(['Male', 'Female'], dtype=object)

# Find the no.of unique values from the gender column

In [15]:
df["Gender"].nunique()

2

# Display count of unique values in gender column

In [16]:
df["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

# Find total no.of students having marks between 90 to 100 (include) using between menthod

In [17]:
df["Marks"]

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [18]:
# without between method
(df["Marks"]>=90) & (df["Marks"]<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [19]:
df[(df["Marks"]>=90) & (df["Marks"]<=100)]

      Name  Marks  Gender
0   Priyaj     98    Male
2  Krishna     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [20]:
# find no.of students have 90 to 100 marks
len(df[(df["Marks"]>=90) & (df["Marks"]<=100)])

4

In [21]:
# using between method
df["Marks"].between(90,100) # here 90 & 100 both are inclusive

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [22]:
# count no.of students 
print(f'{sum(df["Marks"].between(90,100))} students are there between 90 & 100 marks')

4 students are there between 90 & 100 marks

In [23]:
sum(df["Marks"].between(90,100)) # only count

4

# Find average Marks

In [24]:
df["Marks"]

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [25]:
df["Marks"].mean() # by using mean method we find the avgerage

np.float64(92.14285714285714)

In [26]:
df["Marks"].min() # minimum value

np.int64(83)

In [27]:
df["Marks"].max() # Here maximum value

np.int64(99)

# Apply method

In [28]:
def marks(x):
    return x/2

In [29]:
df["Marks"].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [30]:
# addaing a new column for these values
df["Half_marks"] = df["Marks"].apply(marks)
df

      Name  Marks  Gender  Half_marks
0   Priyaj     98    Male        49.0
1   Aadhya     89  Female        44.5
2  Krishna     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [31]:
df

      Name  Marks  Gender  Half_marks
0   Priyaj     98    Male        49.0
1   Aadhya     89  Female        44.5
2  Krishna     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [37]:
# to eleminate the folat values we use double //
def marks(x):
    return x//2

df["Half_marks"] = df["Marks"].apply(marks)
df

      Name  Marks  Gender  Half_marks
0   Priyaj     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [ ]:
# by sing lamda to reduce the code
df["Marks"].apply(lambda x : x//2) # compare the ablove code it is done in single line
df

      Name  Marks  Gender  Half_marks
0   Priyaj     98    Male          49
1   Aadhya     89  Female          44
2  Krishna     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

# Map Function

In [44]:
# by using map we are encoding the code means coverting male to 1 and female to 0
df["Gender"].map({'Male':1, 'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [42]:
df["Male/Female"] = df["Gender"].map({"Male":1, "Female":0})
df

      Name  Marks  Gender  Half_marks  Male/Female
0   Priyaj     98    Male          49            1
1   Aadhya     89  Female          44            0
2  Krishna     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

# Drop the cloumns

In [45]:
df

      Name  Marks  Gender  Half_marks  Male/Female
0   Priyaj     98    Male          49            1
1   Aadhya     89  Female          44            0
2  Krishna     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [47]:
# let remove the newly created columns
df.drop('Half_marks', axis=1)

      Name  Marks  Gender  Male/Female
0   Priyaj     98    Male            1
1   Aadhya     89  Female            0
2  Krishna     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [50]:
df.drop(["Half_marks","Male/Female"], axis=1)
df

      Name  Marks  Gender  Half_marks  Male/Female
0   Priyaj     98    Male          49            1
1   Aadhya     89  Female          44            0
2  Krishna     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [53]:
df

      Name  Marks  Gender
0   Priyaj     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Print Name of the columns

In [54]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

# Sort the dataset as per the marks column

In [55]:
df

      Name  Marks  Gender
0   Priyaj     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [56]:
df.sort_values(by="Marks", ascending=False)

      Name  Marks  Gender
2  Krishna     99  Female
6  Archana     99  Female
0   Priyaj     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [58]:
df.sort_values(by=["Marks","Gender"], ascending=True)

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0   Priyaj     98    Male
2  Krishna     99  Female
6  Archana     99  Female

# Display Name & Marks of the Female Students

In [59]:
df["Gender"]

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [60]:
df["Gender"]=='Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [65]:
# let see the Name & marks 
df[df["Gender"]=='Female'][['Name','Marks']] # here we used todo list

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6  Archana     99

In [66]:
# let od this by using builtin method as isin()
df["Gender"].isin(["Female"])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [74]:
# lets pass thorugh the dataframe to see the values 
df[df["Gender"].isin(["Female","Name"])] [["Name","Marks"]]

      Name  Marks
1   Aadhya     89
2  Krishna     99
5   Mittal     83
6  Archana     99

In [75]:
df

      Name  Marks  Gender
0   Priyaj     98    Male
1   Aadhya     89  Female
2  Krishna     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female